# Задача 14:
# Требуется вывести все целые степени двойки
# (т.е. числа вида 2k), не превосходящие числа N.

print("\033[H\033[J", end="")

num = int(input('Введите число N: '))

k = 0
while 2**k <= num:
    print(f'k = {k}, 2**k = {2**k}')
    k += 1

print('\n')